In [ ]:
#Refazendo os dados para obter uma precisção melhor

In [1]:
import pandas as pd

In [3]:
base = pd.read_csv('titanic_train.csv')
base.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [4]:
# Retirando colunas com alta cardinalidade
base.drop(['PassengerId', 'Name'],axis=1)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
# Retirando a coluna Cabin pela altar cardinalidade e valores vazios
base = base.drop('Cabin', axis=1)

In [15]:
base = base.drop('Survived', axis=1)

In [16]:
# Calculando a média

base['Age'].mean()

29.65344637067425

In [17]:
# Filtrando apenas Age vazio

base.loc[base.Age.isnull(),'Age']

Series([], Name: Age, dtype: float64)

In [18]:
# Atribuindo a média para esses valores
base.loc[base.Age.isnull(), 'Age'] = base['Age'].mean()

In [19]:
# Eliminando todas as outros linhas com valores vazios
base = base.dropna()

In [20]:
# Para conseguir usar esses dados, não pode haver dados do tipo objeto, eliminando novamente

In [21]:
# Novamente eliminando dados do tipo objeto     
colunas = base.dtypes[base.dtypes.values == 'object'].index
base = base.drop(colunas, axis=1)

In [24]:
base.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 0 to 890
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Pclass       889 non-null    int64
 2   Age          889 non-null    float64
 3   SibSp        889 non-null    int64
 4   Parch        889 non-null    int64
 5   Fare         889 non-null    float64
dtypes: float64(2), int64(4)
memory usage: 48.6 KB

In [ ]:
# Avaliando o modelo

In [ ]:
# PARA UNIR DOIS VALORES EM UMA COLUNA, DEVE SE USAR O METODO CONCAT

# EXEMPLO:

# pd.concat([base,pd.get_dummies(base.Embarked)], axis=1) 

# Utilizando o método concat e passando quais os valores que serão unidos e se serão unidos em colunas ou linhas